Revit 2024 API
ExternalServices.BuiltInExternalServices.ElectricalAnalyticalLoadSetUIService Property
 The UI service which permits registration of an external server for UI managing Electrical Analytical Load Set.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId ElectricalAnalyticalLoadSetUIService { get; }
Visual Basic
Public Shared ReadOnly Property ElectricalAnalyticalLoadSetUIService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ ElectricalAnalyticalLoadSetUIService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace